OpenFOAM-2.4.0/tutorials/compressible/sonicFoam/ras/nacaAirfoil/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    INLE1
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    OUTL2
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    SYMP3
    {
        type            empty;
    }

    WALL10
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
